import matplotlib.pyplot as plt

# Данные
data = {
    'n': [65527, 65528, 65529, 65530, 65531, 65532, 65533, 65534, 65535, 65536],
    'lambda_1e-05': [195.758894, 127.274931, 82.400717, 52.996366, 33.728518, 21.102635, 12.828979, 7.407215, 3.854244, 1.525879],
    'lambda_1e-06': [732717066011.794556, 48012751183.554840, 3146179558.555983, 206165999.292615, 13510056.933645, 885326.540919, 58016.218879, 3800.976872, 248.093218, 15.258789],
    'lambda_1e-07': [6892146081629683580928.000000, 45162165629094830080.000000, 295938638934332544.000000, 1939256307072786.750000, 12707946580246.970703, 83276444734.016434, 545727196.630956, 3576313.037682, 23436.009861, 152.587891],
    'lambda_1e-08': [68514678955708560711503885369344.000000, 44895613679307152366508179456.000000, 29419197731776384332726272.000000, 19278106081655751966720.000000, 12632942915309012992.000000, 8278493821831148.000000, 5425062571321.388672, 3555206253.864045, 2329867.866407, 1525.878906],
    'lambda_1e-09': [684742647055646799919824531863557113905152.000000, 44869131433615364034630031537034231808.000000, 2940184444581947549682389475131392.000000, 192667346469010465834414374912.000000, 12625491214114255334801408.000000, 827361064752121380864.000000, 54218625295336032.000000, 3553109171478.255859, 232849455.443656, 15258.789062]
}

# Построение графика
plt.figure(figsize=(12, 8))
plt.plot(data['n'], data['lambda_1e-05'], label=r'$\lambda = 10^{-5}$ 1\hours', marker='o')
plt.plot(data['n'], data['lambda_1e-06'], label=r'$\lambda = 10^{-6}$ 1\hours', marker='o')
plt.plot(data['n'], data['lambda_1e-07'], label=r'$\lambda = 10^{-7}$ 1\hours', marker='o')
plt.plot(data['n'], data['lambda_1e-08'], label=r'$\lambda = 10^{-8}$ 1\hours', marker='o')
plt.plot(data['n'], data['lambda_1e-09'], label=r'$\lambda = 10^{-9}$ 1\hours', marker='o')

# Настройка графика
plt.xlabel('Number n of elementary machines in base subsystem', fontsize=14)
plt.ylabel('Meen time between failures (hours)', fontsize=14)
plt.title(r'Mean time between failures ($N = 65536$, $\mu = 1 \, \text{hours}^{-1}$, $m = 1$)', fontsize=16)
plt.yscale('log')  # Логарифмическая шкала для y-оси
plt.xticks(data['n'])  # Метки по горизонтальной оси
plt.legend()
plt.grid(True)
# Сохранение графика в файл
plt.savefig('theta_vs_n_2.2.png')
#plt.show()
